Cats99/app/controllers/cats_controller.rb

  def create
    @cat = Cat.create(cat_params)
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "faith111111"], ["sex", "F"], ["description", "    hello, please work"], ["updated_at", "2018-09-12 00:22:41.556239"], ["id", 4]]